---
kind: enumMember
id: F:Autodesk.Revit.DB.StorageType.Double
enum: Autodesk.Revit.DB.StorageType
source: html/3dbebcb8-792b-a3dd-fe63-faaa05704f3c.htm
---
# Autodesk.Revit.DB.StorageType.Double

The data will be stored internally in the form of an 8 byte floating point number.